const n=`# 🌈 Дизайн та Стиль

---

## Логотип

**Colir** має дві версії логотипу:

- **Мініатюрна версія**: іконка пензлика, яка частково розфарбована в 4 яскраві кольори справа. Ця версія логотипу натхненна іконкою пензлика з [Lucide Icons](https://lucide.dev/icons/brush).
- **Повна версія**: текст **Colir** з літерою **"o"** посередині розфарбованою в 4 яскраві кольори та **"i"** задекорованою під пензлик.

Ідея з яскравим розфарбуванням частини логотипу натхненна виглядом прапора **Сейшельських островів** 🇸🇨.\\
Кольори логотипу: **#FF0000**, **#FFC701**, **#0864FB**, **#14C35A**, **#FFFFFF**/**#1E293B** (темна/світла тема інтерфейсу).

[Завантажити логотип](https://drive.google.com/drive/folders/1F60xTbwwOsoaGR03LWg51GxRNs9wNPxc?usp=sharing).

## Шрифт

Основний і єдиний використовуваний тут шрифт: [Inter](https://fonts.google.com/specimen/Inter).

## Іконки

З метою прикраси та доступності ми використовуємо [Lucide Icons](https://lucide.dev/).`;export{n as default};
