const n=`# 🌈 Дизайн и Стиль

---

## Логотип

**Colir** имеет две версии логотипа:

- **Миниатюрная версия**: иконка кисточки, которая частично раскрашена в 4 якрих цвета справа. Эта версия логотипа вдохновлена иконкой кисточки из [Lucide Icons](https://lucide.dev/icons/brush).
- **Полная версия**: текст **Colir** с буквой **"o"** посредине раскрашенной в 4 ярких цвета и **"i"** задекорированной под кисточку.

Идея с яркой раскраской части логотипа вдохновлена видом флага **Сейшельских островов** 🇸🇨.\\
Цвета логотипа: **#FF0000**, **#FFC701**, **#0864FB**, **#14C35A**, **#FFFFFF**/**#1E293B** (тёмная/светлая тема интерфейса).

[Скачать логотип](https://drive.google.com/drive/folders/1F60xTbwwOsoaGR03LWg51GxRNs9wNPxc?usp=sharing).

## Шрифт

Основной и единственный используемый здесь шрифт: [Inter](https://fonts.google.com/specimen/Inter).

## Иконки

В целях украшения и доступности мы используем [Lucide Icons](https://lucide.dev/).
`;export{n as default};
