const n=`# 🔑 Як працюють ключі?

---

Ключі мають вирішальне значення для безпечного, **наскрізного зашифрованого спілкування** в **Colir**. Ось основна інформація:

1. **Ключі шифрування**:

   - Ви встановлюєте власний ключ для кімнати, але він повинен збігатися з ключами інших учасників, щоб читати їхні повідомлення та надсилати ті, які вони можуть розшифрувати.

2. **Алгоритм шифрування**:

   - Ми використовуємо AES-256, потужний і широко довірений метод шифрування.

3. **Зберігання на стороні клієнта**:

   - Ключі зберігаються лише на вашому пристрої, ніколи на наших серверах. Це означає, що лише користувачі з правильним ключем можуть читати повідомлення.

4. **Що не зашифровано**:

   - Назви кімнат, імена користувачів, часові мітки та реакції не зашифровані.

5. **Розповсюдження ключів**:

   - Діліться ключами безпечно поза Colir, наприклад, особисто або через інший зашифрований канал.

6. **Доступ до кімнати**:

   - Щоб приєднатися до кімнати, вам потрібні дві речі:<br>
     **a)** GUID кімнати (унікальний ідентифікатор)<br>
     **b)** Ключ шифрування для цієї кімнати
   - Ви можете вільно ділитися GUID, але тримайте ключ у таємниці!

7. **Процес розшифрування**:

   - Коли ви входите в кімнату, ви вводите ключ. Це розшифровує вхідні повідомлення та шифрує вихідні на вашому пристрої.
   - Неправильний ключ? Повідомлення виглядатимуть як нісенітниця.

8. **Наслідки для безпеки**:

   - Навіть якщо хтось отримає GUID кімнати, вони не зможуть прочитати повідомлення без правильного ключа.
   - Наші сервери бачать лише зашифровані дані, зберігаючи ваші чати приватними.

9. **Управління ключами**:
   - Ви відповідаєте за запам'ятовування своїх ключів. Ми не можемо відновити їх для вас, оскільки ми їх не зберігаємо.

Ця система ключів забезпечує приватність і безпеку ваших чатів, причому вся магія шифрування відбувається прямо на вашому пристрої.`;export{n as default};
