const n=`# 👀 Что такое комната?

---

В **Colir** комната - это ваше место для безопасных чатов. Вот что вам нужно знать:

1. **Определение**: Это виртуальное пространство для зашифрованного общения, как приватная зона встреч.

2. **Создание**: Любой может создать комнату и установить ключ шифрования. Ключ остается на вашем устройстве, а не на наших серверах.

3. **Идентификация**: Каждая комната получает уникальный GUID (Глобально Уникальный Идентификатор). Поделитесь им, чтобы пригласить других.

4. **Доступ**: Чтобы присоединиться, вам нужен GUID комнаты и правильный ключ шифрования.

5. **Шифрование**: Все чаты в комнате зашифрованы от конца до конца. Вы можете изменить ключ в любое время.

6. **Функции**: У каждой комнаты есть голосовой канал для зашифрованных аудио-чатов и поддержка текстовых сообщений.

7. **Срок действия**: Установите дату истечения срока действия для комнат. После этого все данные становятся недоступными и удаляются.

8. **Конфиденциальность**: Мы храним и передаем только зашифрованные данные. Без правильного ключа они нечитаемы.

9. **Хранилище**: У каждой комнаты есть **100МБ** хранилища для файлов. Когда оно заполнено, вы не можете загружать больше, пока не освободите место.

Комнаты в **Colir** дают вам безопасное, гибкое пространство для приватных чатов, сохраняя ваши разговоры в тайне.`;export{n as default};
