const n=`# 📝 Що таке Colir Id?

---

**Colir Id** (або _Hex Id_) - це ваше унікальне ім'я користувача в **Colir**. Ось що вам потрібно знати:

1. **Що це**: 6-символьний код, що використовує цифри 0-9 та літери A-F.

2. **Приклад**: Щось на кшталт **#F4CA16**

3. **Мета**: Так ми ідентифікуємо вас без використання особистої інформації.

4. **Як ви його отримуєте**:

   - Якщо ви входите через **GitHub** або **Google**, ви можете вибрати з кількох варіантів, які ми генеруємо, з можливістю перегенерації. Однак, після вибору його не можна змінити.
   - Для анонімних входів ми призначаємо випадковий без надання вибору.

5. **Використання**: Так інші бачать вас у кімнатах, і він може використовуватися для додавання друзів або прямих повідомлень.

6. **Конфіденційність**: Він не розкриває жодної особистої інформації про вас.

7. **Постійність**:

   - Якщо ви використовуєте GitHub або Google, ваш Id залишається незмінним при кожному вході.
   - Анонімні користувачі отримують новий Id кожного разу.

8. **Хто може його бачити**: Ви можете бачити свій власний, і інші в тій самій кімнаті також можуть його бачити.

9. **Безпека**: Знання чийогось Colir Id не дає доступу до їхнього облікового запису або повідомлень.

**Colir Id** дозволяє нам ідентифікувати користувачів, зберігаючи при цьому конфіденційність та безпеку.`;export{n as default};
