const n=`# 🎫 Что такое GUID?

---

В **Colir** GUID - ключ к поиску и присоединению к комнатам. Вот что вам нужно знать:

1. **Определение**: GUID означает Глобально Уникальный Идентификатор. Это уникальный номер, используемый для идентификации объектов в программном обеспечении.

2. **Как он выглядит**: Это 32-символьная строка из букв и цифр, например: 870280c0-c112-4766-a055-ada5161ac7e6

3. **Цель**: У каждой комнаты в Colir есть свой GUID. Думайте о нем как об адресе комнаты.

4. **Обмен**: Вы можете поделиться GUID комнаты с другими, чтобы пригласить их. Его безопасно открыто распространять.

5. **Доступ**: Знание GUID позволяет попытаться присоединиться к комнате, но вам все равно нужен ключ шифрования, чтобы читать сообщения.

6. **Конфиденциальность**: GUID не раскрывает ничего о том, что находится в комнате или кто там находится.

7. **Создание**: Мы автоматически генерируем GUID при создании новой комнаты.

8. **Как его использовать**: Вам не нужно понимать технологию, стоящую за GUID. Просто думайте о нем как о "коде" для поиска конкретной комнаты.

Короче говоря, GUID - это как номер комнаты или адрес в **Colir**. Он помогает найти нужную комнату, не компрометируя безопасность того, что находится внутри.`;export{n as default};
