const n=`# 🎯 Яка головна мета?

---

Головна мета **Colir** - забезпечити безпечне спілкування через швидку платформу обміну повідомленнями з наскрізним шифруванням. Ось як ми цього досягаємо:

1. **Наскрізне шифрування**: Користувачі узгоджують секретний ключ перед використанням застосунку. Цей ключ шифрує та розшифровує дані, забезпечуючи безпечне спілкування.

2. **Зберігання ключів на стороні клієнта**: Ключі шифрування для кімнат зберігаються лише на вашому пристрої, а не на наших серверах, максимально підвищуючи безпеку.

3. **Зашифрована передача даних**: Наш API обробляє лише зашифровані дані, без доступу до фактичного вмісту.

4. **Спілкування на основі кімнат**: Створюйте кімнати або приєднуйтесь до них, використовуючи GUID, але для читання повідомлень вам знадобиться правильний ключ шифрування.

5. **Термін дії даних**: Встановіть дату закінчення терміну дії для кімнат, після чого всі дані стають недоступними та видаляються.

6. **Аутентифікація без пароля**: Увійдіть анонімно або використовуйте сторонніх провайдерів, таких як GitHub та Google.

Зосередившись на цих функціях, **Colir** прагне надати вам зручну платформу для приватних, зашифрованих чатів, зберігаючи при цьому безпеку ваших даних.
`;export{n as default};
