const n=`# 🔒 Навіщо потрібна аутентифікація?

---

Аутентифікація в **Colir** служить кільком важливим цілям:

1. **Ідентифікація користувача**: Ви отримуєте унікальний "Colir ID" - 6-символьне шістнадцяткове число. Це допомагає ідентифікувати вас у системі для приєднання до кімнат та спілкування.

2. **Постійний доступ**: Хоча ми пропонуємо анонімний вхід, він одноразовий. Ваша сесія закінчиться, унеможливлюючи доступ до облікового запису пізніше. Використання **GitHub** або **Google** дозволяє входити багаторазово.

3. **Безпека**: Аутентифікація допомагає захистити ваші дані та гарантує, що тільки ви можете отримати доступ до вашого облікового запису. Вона також допомагає запобігти несанкціонованому доступу до вашого облікового запису.

4. **Відновлення облікового запису**: Якщо ви використовуєте **GitHub** або **Google**, ви можете відновити свій обліковий запис при необхідності. Це неможливо при анонімній аутентифікації.

5. **Colir ID**: Коли ви обираєте вхід через **GitHub** або **Google**, ви можете вибрати **Colir ID**. Цей ID постійний при всіх входах і допомагає іншим ідентифікувати вас у кімнатах.

Пам'ятайте, навіть з аутентифікацією ми все ще пріоритетно ставимося до вашої конфіденційності. Процес аутентифікації не впливає на наскрізне шифрування ваших повідомлень, оскільки ключі шифрування керуються на вашому пристрої і не передаються нашим серверам.`;export{n as default};
