const n=`# 🔒 Зачем нужна аутентификация?

---

Аутентификация в **Colir** служит нескольким важным целям:

1. **Идентификация пользователя**: Вы получаете уникальный "Colir ID" - 6-символьное шестнадцатеричное число. Это помогает идентифицировать вас в системе для присоединения к комнатам и общения.

2. **Постоянный доступ**: Хотя мы предлагаем анонимный вход, он одноразовый. Ваша сессия истечет, делая невозможным доступ к аккаунту позже. Использование **GitHub** или **Google** позволяет входить многократно.

3. **Безопасность**: Аутентификация помогает защитить ваши данные и гарантирует, что только вы можете получить доступ к вашему аккаунту. Она также помогает предотвратить несанкционированный доступ к вашему аккаунту.

4. **Восстановление аккаунта**: Если вы используете **GitHub** или **Google**, вы можете восстановить свой аккаунт при необходимости. Это невозможно при анонимной аутентификации.

5. **Colir ID**: Когда вы выбираете вход через **GitHub** или **Google**, вы можете выбрать **Colir ID**. Этот ID постоянен при всех входах и помогает другим идентифицировать вас в комнатах.

Помните, даже с аутентификацией мы по-прежнему приоритетно относимся к вашей конфиденциальности. Процесс аутентификации не влияет на сквозное шифрование ваших сообщений, так как ключи шифрования управляются на вашем устройстве и не передаются нашим серверам.`;export{n as default};
